# ClearValues Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ElectricalDemandFactorDefinition..::..ClearValues Method
ElectricalDemandFactorDefinition Class See Also
---
Clears all the values stored for this demand factor definition.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public void ClearValues()
```

Visual Basic
---
```text
Public Sub ClearValues
```

Visual C++
---
```text
public:
void ClearValues()
```

# See Also
ElectricalDemandFactorDefinition Class
Autodesk.Revit.DB.Electrical Namespace